alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }
        if (ev.type != INPUT_CHAR) continue;
        char ch = ev.ch;

        // Models 1–3 (Gemini)
        if (ch >= '1' && ch <= '3') {
            int i = ch - '1';
            halClickSound();
            slideOutSlug();
            strncpy(GEMINI_MODEL, modelIds[i], 47); GEMINI_MODEL[47] = '\0';
            geminiUseGlobal = modelGlobal[i];
            useGrok = false; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI chatbot", 0, 0);
                tft.drawString(GEMINI_MODEL, 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("SLUG AI Chatbot v0.2");
                tft.setCursor(0, 10); tft.print("Model: "); tft.print(GEMINI_MODEL);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }
        if (ch == '4') {
            halClickSound();
            slideOutSlug();
            useGrok = true; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI Chatbot", 0, 0);
                tft.drawString("Grok 4.1 Fast", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("SLUG AI Chatbot. Swipe down/up to scroll.");
                tft.setCursor(0, 10); tft.print("Model: Grok 4.1 Fast");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }
        if (ch == '5') {
            halClickSound();
            slideOutSlug();
            useGroq = true; useGrok = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI chatbot", 0, 0);
                tft.drawString("Groq GPT-OSS-120b", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("SLUG AI chatbot. Swipe down/up to scroll.");
                tft.setCursor(0, 10); tft.print("Model: Groq GPT-OSS-120b");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }
        if (ch == 'b' || ch == 'B') {
            largeFont = !largeFont;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
            tft.setTextSize(1); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.setCursor(0, 0); tft.print("SLUG AI chatbot. Large text.");
            tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
            showModelChoices();
            continue;
        }
        if (ch == 'i' || ch == 'I') {
            invertDisplay = !invertDisplay;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
            tft.setTextSize(1); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.setCursor(0, 0); tft.print("SLUG AI chatbot");
            tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
            showModelChoices();
            continue;
        }
#ifndef TARGET_C3
        if (ch == 'c' || ch == 'C') {
            calibrateTouch();
            tft.fillScreen(COL_BG);
            tft.setTextSize(1); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.setCursor(0, 0); tft.print("SLUG AI chatbot");
            tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
            drawKeyboard();
            drawInputBar(); showModelChoices();
            continue;
        }
#endif
    }
}

void setup() {
    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored

#ifndef TARGET_C3
    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        Serial.begin(115200);
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
#endif
    Serial.begin(115200);
#ifndef TARGET_C3
    Serial.println("[Cal] Loaded touch calibration from NVS");
#endif
    waitMsgIdx = random(NUM_WAIT_MSGS);

    // Display (init before backlight to avoid white flash)
    tft.init();
#ifdef ROTATE_180
    tft.setRotation(3);
#else
    tft.setRotation(1);
#endif
    tft.fillScreen(COL_BG);

    // Hardware init (backlight, touch, LED, speaker) — delegated to HAL
    halInit();
    halLoadTouchCal(); // load saved touch calibration from NVS (or keep defaults)

    // Boot splash at bottom; white area above it; "Connecting..." is the only text shown
    unsigned long splashStart = millis();
    tft.fillRect(0, 0, SCREEN_W, SCREEN_H - SLUG_H, TFT_WHITE);
    tft.pushImage(0, SCREEN_H - SLUG_H, SLUG_W, SLUG_H, SLUG_SPLASH);
    bool wifiOk = connectWiFi(wifiSsid[0], wifiPass[0], true);
    // Splash visible for at least 3 seconds
    long splashRemain = 3000L - (long)(millis() - splashStart);
    if (splashRemain > 0) delay(splashRemain);
    tft.fillScreen(COL_BG);  // clear splash; back to normal dark background

    if (!wifiOk) {
        selectAP();  // scan → pick AP → enter password → connect; returns only on success
    }

#ifndef TARGET_C3
    drawKeyboard();
#endif
    drawInputBar();

    tft.setTextSize(1);
    tft.setTextColor(TFT_DARKGREY, COL_BG);
    tft.setCursor(0,  0); tft.print("SLUG AI chatbot");
    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");

    selectModel();  // draws choices at y=30+ and waits for 1/2/3
}

void checkWiFiHealth() {
    updateLedWifi();  // instant — runs every loop, LED reacts immediately to dropout

