alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    if (millis() - lastWiFiCheckMs < 3000) return;
    lastWiFiCheckMs = millis();

#ifndef TARGET_C3
    bool ok = (WiFi.status() == WL_CONNECTED) && Ping.ping(IPAddress(8,8,8,8), 1);
#else
    bool ok = (WiFi.status() == WL_CONNECTED);
#endif

    if (ok != wifiHealthy) {
        wifiHealthy = ok;
        drawInputBar();  // '>' and Send/More turn red on fail, white on recovery
    }

    if (!ok) {
        // Reconnect in background — status checked on next 10s tick
        WiFi.disconnect(false);
        WiFi.begin(wifiSsid[0], wifiPass[0]);
    }
}

void loop() {
    InputEvent ev;
    if (halPollInput(&ev)) {
        switch (ev.type) {
            case INPUT_SCROLL_UP: {
                int lineH     = largeFont ? LINE_H_LARGE : LINE_H_SMALL;
                int histH     = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
                int maxVis    = histH / lineH;
                scrollOffset  = max(0, scrollOffset - 3);
                drawHistory();
                break;
            }
            case INPUT_SCROLL_DOWN: {
                int lineH     = largeFont ? LINE_H_LARGE : LINE_H_SMALL;
                int histH     = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
                int maxVis    = histH / lineH;
                int maxScroll = max(0, lineCount - maxVis);
                scrollOffset  = min(scrollOffset + 3, maxScroll);
                drawHistory();
                break;
            }
            case INPUT_NEW_CONV:
do_new_conv:
                historyCount = 0; lineCount = 0; scrollOffset = 0;
                moreMode = false; inputBuf[0] = '\0'; inputLen = 0;
                history[historyCount].isUser = true;
                history[historyCount].isError = false;
                history[historyCount].displayOnly = true;
                strncpy(history[historyCount].text, "[New chat]", 2047);
                historyCount++;
                rebuildLines();
#ifndef TARGET_C3
                kbVisible = true;
#endif
                tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
                drawHistory(); drawInputBar();
#ifndef TARGET_C3
                drawKeyboard();
#endif
                break;
            case INPUT_ENTER:
                // Word commands
                if (strcmp(inputBuf, "new") == 0) {
                    inputBuf[0] = '\0'; inputLen = 0;
                    goto do_new_conv;
                }
                if (strcmp(inputBuf, "more") == 0) {
                    if (moreMode) sendPrompt();
                    break;
                }
                if (inputLen == 0 && !moreMode) break;
                sendPrompt();
                break;
            case INPUT_MORE:
                if (moreMode) sendPrompt();
                break;
            case INPUT_BACKSPACE:
                if (inputLen > 0) {
                    halClickSound();
                    inputBuf[--inputLen] = '\0';
                    if (inputLen == 0 && historyCount > 0) moreMode = true;
                    drawInputBar();
                }
                break;
            case INPUT_CHAR:
                if (ev.ch != 0 && inputLen < INPUT_MAX_LEN) {
                    moreMode = false;
                    inputBuf[inputLen++] = ev.ch;
                    inputBuf[inputLen]   = '\0';
                    drawInputBar();
                    halClickSound();
                }
                break;
            default:
                break;
        }
    }
    checkWiFiHealth();
}
